WAYBILL_REGEX = [
    # Первое слово: ТОВАРНАЯ
    [
        r'товарн\w*',
        r'[ТTтt]оварн\w*',
        r'\b[Тт]оварн(?:ая|ой|ую|ою|ые|ых|ыми)\b',
        r'\b(?:[Тт]оварн\w*|[Тт]ов\.?)\b',
        r'\b[ТTтt][оo0о][вbв][аaа][рpр][нnhн][аaоoыуя]?[яя]?\b',
        r'[ТтT][оo0ОO][вbвBV][аaаA@][рpрP][нnнH][а-яa-zё]*',
        r'[Тт]оварн[а-яё]*[-\s]?',
        r'\b[Тт]товарная\b',
        r'[ТтTt][ОоOo0][ВвVvBb][АаAa@][РрRrPp][НнNnHh][АаAaЯяYy]\w*',
        r'(?:[Тт]оварн\w*|ТН)',
    ],

    # Второе слово: НАКЛАДНАЯ
    [
        r'накладн\w*',
        r'[НHнh]акладн\w*',
        r'\b[Нн]акладн(?:ая|ой|ую|ою|ые|ых|ыми)\b',
        r'\b(?:[Нн]акладн\w*|[Нн]акл\.?)\b',
        r'\b[НHнhN][аaа][кkкK][лlл][аaа][дdд][нnhн][аaая]?[яя]?\b',
        r'[НнN][аaаA@][кkкK][лlлL][аaаA@][дdдD][нnнH][а-яa-zё]*',
        r'[Нн]акладн[а-яё]*[-\s]?',
        r'\b[Нн]акладная\b',
        r'[НнNnHh][АаAa@][КкKk][ЛлLl][АаAa@][ДдDd][НнNnHh][АаAaЯяYy]\w*',
        r'(?:[Нн]акладн\w*|ТН)',
    ]
]